---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.GetValues
source: html/37881fca-9910-92f1-7347-6093e8a0cbca.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.GetValues Method

Returns all the values stored in the map.

## Syntax (C#)
```csharp
public IList<ExportLineweightInfo> GetValues()
```

## Returns
The info.